streets ='''25 Октября улица
3 Июля улица
5-й Армии улица
8 Марта переулок
9 Января улица
9 км Каи улица
Авиастроителей улица
Авиаторов улица
Автомобильная улица
Айвазовского переулок
Академика Бурденко улица
Академика Курчатова улица
Академика Образцова улица
Академика Павлова улица
Академика Павлова проезд
Академическая улица
Аксакова улица
Аларская улица
Аларская 2-я улица
Александра Матросова улица
Александра Невского улица
Александра Чекалина улица
Александровский тракт 8 км
Алексеева переулок
Алзамайский переулок
Алмазная улица
Алтайская улица
Альпийская улица
Алябьева улица
Амундсена улица
Амурский проезд
Ангаргэсстроя улица
Ангарская улица
Ангарский Мост улица
Андреева улица
Аносова переулок
Аргунова улица
Арктическая улица
Арсентьева проезд
Артиллерийская улица
Архипова переулок
Атласова улица
Афанасьева улица
Аэропорт тер
Аэрофлотская улица
Бабушкина улица
Багратиона улица
Баженова улица
Бажова улица
Байкальская улица
Бакинская улица
Балакирева улица
Барабинский проезд
Баргузинская улица
Баррикад улица
Батаева улица
Баумана улица
Баха улица
Безбокова улица
Безымянная улица
Бекетова переулок
Белинского улица
Белобородова улица
Белорусская улица
Береговая улица
Березовая улица
Березовая Роща улица
Бестужева улица
Бийская улица
Бирюсинская улица
Блюхера улица
Богдана Хмельницкого улица
Богданова переулок
Бограда улица
Бодайбинская улица
Боковский переулок
Большевистский переулок
Бородина улица
Бородина переулок
Борцов Революции улица
Ботаническая улица
Боткина улица
Бочкина улица
Братская улица
Бродского улица
Брусничная улица
Булавина улица
Бурлова улица
Вавилова улица
Вагина улица
Вампилова улица
Варламова улица
Василия Долгополова улица
Ватутина улица
Верещагина переулок
Верхняя Набережная улица
Весенний проезд
Вилюйская улица
Витимский переулок
Владимира Давыдова улица
Владимирского улица
Воинская Площадка улица
Войкова улица
Вокзальная улица
Волгоградская улица
Волжская улица
Волконского переулок
Володарского улица
Волочаевская улица
Волочаевский переулок
Воровского улица
Воронежская улица
Ворошилова 1-я улица
Ворошилова 2-я улица
Восточный переулок
Вьюжная улица
Гаврилова улица
Гагарина бульвар
Гайдара проезд
Гаражный переулок
Гастелло улица
Генерала Доватора улица
Геологов улица
Герцена улица
Гершевича переулок
Гидростроителей улица
Глеба Успенского улица
Глинки улица
Гоголя улица
Гончарная улица
Гончарова улица
Горная улица
Горького улица
Госпитальная улица
Гравийная улица
Гражданская улица
Гранитная улица
Грибоедова улица
Громовой проезд
Грязнова улица
Гусарова переулок
Дальневосточная улица
Дальний переулок
Даргомыжского улица
Дежнева улица
Декабристов площадь
Декабристов улица
Декабрьских Событий улица
Делегатская улица
Демьяна Бедного улица
Деповский переулок
Депутатская улица
Державина улица
Детская улица
Джамбула улица
Дзержинского улица
Динамо переулок
Дмитрия Донского улица
Дмитрия Донского проезд
Дмитрия Пожарского улица
Дмитрова переулок
Добролюбова улица
Донская улица
Доржы Банзарова улица
Дорожная улица
Достоевского улица
Дружбы улица
Дундича переулок
Егорова улица
Еланская улица
Еловая улица
Енисейская улица
Ербанова проезд
Ереванская улица
Есенина улица
Есенина проезд
Железнодорожная 1-я улица
Железнодорожная 2-я улица
Железнодорожная 3-я улица
Железнодорожная 4-я улица
Железнодорожная 5-я улица
Желябова улица
Жигаловская улица
Жигулевская улица
Жукова улица
Жуковского улица
Журавлева улица
Журавлева переулок
Заводской 1-й переулок
Заводской 2-й переулок
Заводской 3-й переулок
Заводской 4-й переулок
Заводской 5-й переулок
Загоскина улица
Загоскина переулок
Заларинский переулок
Западный переулок
Западный 1-й переулок
Западный 2-й переулок
Западный 3-й переулок
Западный 4-й переулок
Западный 5-й переулок
Заслонова проезд
Затон улица
Затон Вилкова улица
Захарова улица
Звездинская улица
Зверева улица
Звероферма улица
Зеленый мкр
Зеленый переулок
Земляничный переулок
Зимняя улица
Зои Космодемьянской улица
Ивана Кочубея улица
Ивана Кочубея переулок
Ивана Сивко улица
Ивана Франко улица
Игошина улица
Известковая улица
Ингинская улица
Индустриальная улица
Инженерная улица
Иосифа Уткина улица
Ипподромная улица
Иркутная улица
Иркутный переулок
Иркутский 4-й переулок
Иркутской 30 Дивизии улица
Кайская улица
Каландарашвили улица
Калинина улица
Калужская улица
Каменная улица
Камчатский проезд
Камышовая улица
Канадзавы улица
Канская улица
Карбышева улица
Карельская улица
Карла Либкнехта улица
Карла Либкнехта переулок
Карла Маркса улица
Карлукский проезд
Карпатская улица
Карпинская улица
Карьерная улица
Карьерная 1-я улица
Карьерная 2-я улица
Карьерная 3-я улица
Касаткина улица
Каспийский переулок
Касьянова улица
Каховского улица
Качугская улица
Качугский проезд
Каштаковская улица
Каштаковский проезд
Кедровая улица
Кемеровская улица
Киевская улица
Киренская улица
Кирова площадь
Кирпичная улица
Клары Цеткин улица
Ключевая 1-я улица
Ключевая 2-я улица
Книжный проезд
Кожзаводская улица
Кожова улица
Колхозная улица
Кольцова улица
Коммунаров улица
Коммунистическая улица
Комсомольская улица
Конечный проезд
Кооперативный переулок
Корданная улица
Кордонная улица
Короленко переулок
Космический проезд
Костромская улица
Костычева улица
Котовского улица
Красина улица
Красноармейская улица
Красногвардейская улица
Красного Восстания улица
Красноказачья улица
Красноказачья 2-я улица
Красноказачья 3-я улица
Краснофлотский переулок
Красноярская улица
Красный Путь улица
Красный Путь переулок
Красных Мадьяр улица
Кропоткина улица
Крупской улица
Крымская улица
Кряжева улица
Кубанская улица
Кузьмихинский переулок
Кузьмы Минина проезд
Куликовская улица
Култукская улица
Курганская улица
Курильская улица
Курортная улица
Курочкина улица
Курский переулок
Кутузова улица
Лагерный переулок
Лазарева проезд
Лазо улица
Лапина улица
Лаптевых проезд
Латвийская улица
Лебедева улица
Лебедева-Кумача улица
Левитана улица
Левый берег Каи улица
Ледовского улица
Ледяная улица
Ленина улица
Ленинградская улица
Ленинградский переулок
Ленская улица
Лермонтова улица
Леси Украинки улица
Лескова улица
Лесная улица
Лесной мкр
Лесогорская улица
Лесопильный переулок
Летняя улица
Летчиков проезд
Летчиков 2-я улица
Летчиков 3-я улица
Летчиков 4-я улица
Летчиков 5-я улица
Летчиков 6-я улица
Лизы Чайкиной улица
Линейный переулок
Лисихинский проезд
Лиственичная улица
Лиственничный переулок
Литвинова улица
Литейный переулок
Лобачевского улица
Локомотивный 1-й переулок
Локомотивный 2-й переулок
Ломоносова улица
Лопатина улица
Луганская улица
Луговой проезд
Лунный проезд
Лызина улица
Лыткина улица
Льва Толстого улица
Льва Толстого переулок
МО-31 тер
МОПРА переулок
Майская улица
Макаренко улица
Макарова проезд
Максимовская улица
Малая Ленская улица
Мало-Якутская улица
Мальтинская улица
Мамина-Сибиряка улица
Марата улица
Марии Расковой улица
Марии Ульяновой улица
Марии Цукановой улица
Маршала Говорова улица
Маршала Жукова проспект
Маршала Конева улица
Матросская улица
Маяковского улица
Мегетская улица
Медведева улица
Мелентьева улица
Мельничная улица
Менделеева улица
Металлобаза улица
Мехгорка улица
Милицейский переулок
Минская улица
Минусинский переулок
Мира улица
Миронова улица
Мичурина улица
Можайского улица
Молдавская улица
Молодежная улица
Молчанова-Сибирского улица
Морской проезд
Мостовой проезд
Моторный проезд
Моцарта улица
Мраморный проезд
Муравьева улица
Мурманская улица
Мухиной улица
Набережная Иркута улица
Набережная Каи улица
Нижняя набережная Ангары улица
Напольная улица
Нахимова проезд
Некрасова улица
Нестерова улица
Нестерова 2-я улица
Нефтебаза улица
Никитина улица
Никитина переулок
Николаева улица
Николая Вилкова улица
Новаторов улица
Новгородская улица
Новикова-Прибоя улица
Ново-Сарафановская улица
Новогодний переулок
Новогодняя улица
Новокузьмихинская улица
Новокшонова улица
Новосельский переулок
Норильская улица
Обручева улица
Овражная улица
Огарева проезд
Огородная улица
Огородная 1-я улица
Огородная 2-я улица
Огородная 3-я улица
Одесская улица
Октябрьский переулок
Октябрьской Революции улица
Олега Кошевого улица
Ольховая улица
Ольховая 2-я улица
Ольхонский переулок
Омская улица
Омулевского улица
Онежская улица
Орджоникидзе улица
Орловская улица
Освобождения улица
Осенний переулок
Осетровский проезд
Осинская улица
Островского улица
Офицерский проезд
Павла Красильникова улица
Падь Топка улица
Панфилова улица
Парковая улица
Парниковая улица
Партизанская улица
Пархоменко улица
Пекинская улица
Первомайская улица
Первомайский мкр
Передовая улица
Пестеля улица
Песчаный переулок
Петрова улица
Петрова переулок
Пивзаводской переулок
Пионерский переулок
Писарева улица
Пискунова улица
Плодовоягодный проезд
Пограничный переулок
Подаптечная улица
Подгорная улица
Пожарского улица
Покрышкина улица
Полевая улица
Полевая 2-я улица
Поленова улица
Полетаева переулок
Ползунова улица
Ползунова переулок
Поликарпова улица
Полины Осипенко улица
Полтавская улица
Польских Повстанцев улица
Полярная улица
Помяловского улица
Попова улица
Портовая улица
Посталовского улица
Постышева бульвар
Потанина улица
Почтамтская улица
Почтамтский переулок
Правый Берег Каи улица
Пржевальского улица
Приморский мкр
Прирельсовый Склад тер
Провиантская улица
Пролетарская улица
Просвещения улица
Профсоюзная улица
Пугачева переулок
Пулковский переулок
Пушкина улица
Пшеничная улица
Пшеничная Падь улица
Пшеничный переулок
Рабочая улица
Рабоче-Крестьянская улица
Рабочего Штаба улица
Радищева улица
Радищева проезд
Радищева переулок
Радужный мкр
Ракетный переулок
Ракитная улица
Ремесленная улица
Репина улица
Республиканская улица
Речная улица
Решетникова переулок
Ржанова улица
Родниковая улица
Розы Люксембург улица
Российская улица
Ростовская улица
Ростовский проезд
Роща Кая улица
Рубиновая улица
Руднева проезд
Румянцева улица
Рылеева улица
Рябикова бульвар
Рябиновая улица
Салацкого улица
Самокатный переулок
Саперная улица
Сарайный переулок
Сарайный 2-й переулок
Саратовская улица
Сарафановская улица
Сахалинская улица
Саянский переулок
Свердлова улица
Севастопольская улица
Северная улица
Северная 2-я улица
Северный проезд
Седова улица
Селитбенная улица
Селитбенный проезд
Семашко переулок
Семена Лагоды улица
Серафимовича улица
Сергеева улица
Серова переулок
Сеченова улица
Сибирская улица
Сибирский переулок
Сибирских Партизан улица
Скушникова улица
Славный мкр
Слюдянская улица
Смоленская улица
Снежный переулок
Соболева улица
Советская улица
Советская 4-я улица
Советская 6-я улица
Советский переулок
Советский 1-й переулок
Советский 10-й переулок
Советский 11-й переулок
Советский 12-й переулок
Советский 13-й переулок
Советский 14-й переулок
Советский 15-й переулок
Советский 16-й переулок
Советский 17-й переулок
Советский 18-й переулок
Советский 2-й переулок
Советский 3-й переулок
Советский 4-й переулок
Советский 5-й переулок
Советский 6-й переулок
Советский 7-й переулок
Советский 8-й переулок
Советский 9-й переулок
Совхозная улица
Солнечный переулок
Сосновая улица
Софьи Ковалевской улица
Софьи Перовской улица
Спартаковская улица
Сплавная улица
Спортивный переулок
Станиславского улица
Станционный проезд
Старокузьмихинская улица
Стасова улица
Стеклова переулок
Степана Разина улица
Строительный переулок
Стуковский переулок
Суворова улица
Сударева переулок
Сурикова улица
Сурнова улица
Сухэ-Батора улица
Сюткина переулок
Таежный переулок
Тайшетская улица
Талалихина проезд
Тальниковая улица
Таманская улица
Танкистов переулок
Тарная База тер
Тверская улица
Театральная улица
Тельмана улица
Терешковой улица
Тимирязева улица
Титово проезд
Толбухина проезд
Толевая улица
Топкинская улица
Топкинский переулок
Топкинский мкр
Топкинский 1-й переулок
Топкинский 2-й переулок
Трактовая улица
Трилиссера улица
Тропинина улица
Трубецкого улица
Трубецкого переулок
Трудовая улица
Трудовой проезд
Тувинская улица
Тулунская улица
Тульская улица
Тургенева улица
Тухачевского улица
Угольный проезд
Угольный склад улица
Ударника улица
Удинский проезд
Украинская улица
Улан-Баторская улица
Университетская улица
Университетский мкр
Уральская улица
Урицкого улица
Урожайная улица
Усольская улица
Учительский переулок
Ушаковская улица
Ушинского улица
Фабричная улица
Фаворского улица
Фадеева переулок
Федосеева переулок
Фельдшерская улица
Флотская улица
Флюкова улица
Фомина проезд
Франк-Каменецкого улица
Фридриха Энгельса улица
Фрунзе улица
Фурманова улица
Фурье улица
Хабарова проезд
Хайтинская улица
Халтурина улица
Харьковская улица
Хасановский переулок
Хвойная улица
Хомутовская улица
Храмцовская улица
Цветочная улица
Целинная улица
Центральные склады улица
Цесовская Набережная улица
Цимлянская улица
Циолковского улица
Чаадаева проезд
Чайковского улица
Чалова улица
Чапаева улица
Чапаева переулок
Чаплыгина улица
Чебышева переулок
Чекалина улица
Челнокова улица
Челябинская улица
Черемуховая улица
Черемховский переулок
Чернышевского улица
Черняховского улица
Черского улица
Чехова улица
Читинская улица
Чкалова улица
Чукотская улица
Шаповалова переулок
Шапошникова улица
Шахтерская улица
Шевцова улица
Шевченко улица
Шелехова улица
Ширямова улица
Шишкина улица
Школьная улица
Шмидта улица
Шпальная ветка улица
Шпачека улица
Щапова улица
Щаповский переулок
Щедрина улица
Щепкина улица
Щербакова улица
Щетинкина улица
Щорса улица
Энергетиков улица
Эстонский переулок
Юбилейная улица
Юбилейный мкр
Южная улица
Юлиуса Фучика улица
Юннатская улица
Юрия Смирнова улица
Яблоневая улица
Ягодная улица
Ядринцева улица
Якоби улица
Яковлева улица
Якутский тракт 9 км
Ямская улица
Янки Купалы улица
Ярослава Гашека улица
Ярославского улица'''

streets = streets.replace('\n',',')
streets = streets.split(',')

